import SectionContainer from "./SectionContainer";

const expectedPartnerInfo = [
  {
    title: "বয়স",
    value: "18-28",
  },
  {
    title: "গাত্রবর্ণ",
    value: "উজ্জল শ্যামলা, ফর্সা, উজ্জল ফর্সা",
  },
  {
    title: "উচ্চতা",
    value: "৫' - ৫'৫\"",
  },
  {
    title: "শিক্ষাগত যোগ্যতা",
    value: "গ্র্যাজুয়েশন সম্পন্ন বা অধ্যয়নরত। অন্তত এইচএসসি পাস।",
  },
  {
    title: "জেলা",
    value:
      "গাইবান্ধা, বগুড়া, রংপুর জেলার মধ্যে হলে বেশি ভালো হয়। তবে রংপুর বিভাগের মধ্যে হলেও হবে।",
  },
  {
    title: "বৈবাহিক অবস্থা",
    value: "অবিবাহিত",
  },
  {
    title: "পেশা",
    value: "স্টুডেন্ট অথবা চাকরির জন্য প্রস্তুতি নিচ্ছেন এমন।",
  },
  {
    title: "অর্থনৈতিক অবস্থা",
    value: "মধ্যবিত্ত",
  },
  {
    title: "প্রত্যাশিত গুণাবলি",
    value: `• ইসলামি আদর্শে বিশ্বাসী, নামাজ-রোজা মেনে চলেন এমন,
• দায়িত্বশীল, ভদ্র ও মার্জিত আচরণের অধিকারীনি এবং আমার আব্বু আম্মুকে নিজের মা বাবার মতই দেখবে,
• পর্দাশীল ও চরিত্রবান,
• পরিবারকে সম্মান করতে জানেন এবং পরস্পরের প্রতি সম্মান ও সহমর্মিতা রাখেন,
• অহংকারহীন, সরল ও শান্তিপূর্ণ স্বভাবের,
• জীবনের প্রতি ইতিবাচক দৃষ্টিভঙ্গি থাকুক,
• কথা-বার্তায় নরম, রাগ কম, গালি থেকে দূরে — এমন মিষ্টভাষী মানুষ,
• সংসারে সহযোগী মনোভাবের হোন,
• দুনিয়ার চাইতে আখিরাতকে গুরুত্ব দেন, কিন্তু ভারসাম্যপূর্ণ জীবনযাপন করেন।`,
  },
];

const ExpectedPartnerInfo = () => {
  return (
    <SectionContainer title="প্রত্যাশিত জীবনসঙ্গী">
      {expectedPartnerInfo?.map((info, index) => (
        <h6
          key={index}
          className={`bio-element ${index % 2 !== 0 ? "bg-navy-light/20" : ""}`}
        >
          <span className="bio-label">{info.title}</span>
          <span className="bio-value">{info.value}</span>
        </h6>
      ))}
    </SectionContainer>
  );
};

export default ExpectedPartnerInfo;
