import SectionContainer from "./SectionContainer";

// const expectedPartnerInfo = [
//   {
//     title: "বয়স",
//     value: "18-28",
//   },
//   {
//     title: "গাত্রবর্ণ",
//     value: "উজ্জল শ্যামলা, ফর্সা, উজ্জল ফর্সা",
//   },
//   {
//     title: "উচ্চতা",
//     value: "৫' - ৫'৫\"",
//   },
//   {
//     title: "শিক্ষাগত যোগ্যতা",
//     value: "গ্র্যাজুয়েশন সম্পন্ন বা অধ্যয়নরত। অন্তত এইচএসসি পাস।",
//   },
//   {
//     title: "জেলা",
//     value:
//       "গাইবান্ধা, বগুড়া, রংপুর জেলার মধ্যে হলে বেশি ভালো হয়। তবে রংপুর বিভাগের মধ্যে হলেও হবে।",
//   },
//   {
//     title: "বৈবাহিক অবস্থা",
//     value: "অবিবাহিত",
//   },
//   {
//     title: "পেশা",
//     value: "স্টুডেন্ট অথবা চাকরির জন্য প্রস্তুতি নিচ্ছেন এমন।",
//   },
//   {
//     title: "অর্থনৈতিক অবস্থা",
//     value: "মধ্যবিত্ত",
//   },
// ];

const qualities = [
  "— ইসলামি আদর্শে বিশ্বাসী এবং নিয়মিত নামাজ-রোজা পালনকারী",
  "— দায়িত্বশীল, ভদ্র ও মার্জিত আচরণের অধিকারী, যিনি আমার আব্বু-আম্মুকে নিজের মা-বাবার মতো সম্মান করবেন",
  "— পর্দাশীল, আত্মমর্যাদাশী এবং সুস্থ চরিত্রের অধিকারীনি",
  "— পরিবারকে ভালোবাসেন, পরস্পরের প্রতি সম্মান ও সহমর্মিতা দেখাতে জানেন",
  "— অহংকারহীন, বিনয়ী, সরল ও শান্ত স্বভাবের",
  "— জীবন ও ভবিষ্যৎ সম্পর্কে ইতিবাচক মনোভাব রাখেন",
  "— কথাবার্তায় নরম, রাগ সংযত, গালিগালাজ থেকে দূরে — এমন মিষ্টভাষী ও হৃদয়বান মানুষ",
  "— সংসারে সহযোগিতামূলক ও দায়িত্ববান মনোভাব রাখেন",
  "— দুনিয়ার চেয়ে আখিরাতকে অগ্রাধিকার দেন, তবে ভারসাম্যপূর্ণ ও সচেতনভাবে জীবন পরিচালনা করেন",
];

const ExpectedPartnerInfo = () => {
  return (
    <SectionContainer title="প্রত্যাশিত জীবনসঙ্গীর গুণাবলী ">
      <div className="flex items-center justify-start p-3">
        <ul className="space-y-2">
          {qualities.map((quality, index) => (
            <li key={index}>
              {/* <span className="min-w-4 flex items-center justify-center">
                <PiDotOutlineFill />
              </span>{" "} */}
              {quality}
            </li>
          ))}
        </ul>
      </div>
    </SectionContainer>
  );
};

export default ExpectedPartnerInfo;
