import MobileViewRow from "./MobileViewCol";
import SectionContainer from "./SectionContainer";
const familyInfo = [
  {
    title: "পিতা",
    value: "জীবিত, বাংলাদেশ আনসার বাহিনীতে পিসি (প্লাটুন কমান্ডার) পদে কর্মরত।",
  },
  {
    title: "মাতা",
    value:
      "জীবিত, ক্যারিয়ারের শুরুতে জব করতেন, বর্তমানে পূর্ণকালীন রাব্বাতুল বাইত হিসেবে সংসার পরিচালনা করছেন।",
  },
  {
    title: "ভাই-বোন",
    value: "একজন ছোট ভাই আছে (২০২৫ সালে এসএসসি দিয়েছে)। বোন নেই।",
  },
  {
    title: "চাচা ও মামা",
    value:
      "একজন চাচা আছেন উনি ঢাকায় জব করে, ঢাকাতেই ফ্যামিলি সহ থাকেন। মামা একজন ব্যবসা করেন আর একজন হাই স্কুলের শিক্ষক।",
  },
];

const largeContent = [
  {
    title: "অর্থনৈতিক অবস্থা",
    value: (
      <p>
        আলহামদুলিল্লাহ, আমরা মধ্যবিত্ত অর্থনৈতিক অবস্থায় স্বচ্ছল জীবনযাপন করছি।{" "}
        <br />
        গ্রামের নিজস্ব জমিতে (৩৬ শতাংশ) বড় ও সুন্দর বসতবাড়ি রয়েছে। যদিও চাষের
        নিজস্ব জমি নেই, তবে কিছু জমি বন্ধক নেওয়া আছে। গবাদি পশুও পালন করা হয়।{" "}
        <br />
        আমি এবং আব্বু দুজনেই জব করছি, আল্লাহর রহমতে সবকিছু ভালোভাবেই চলছে।
        এলাকায় আমি একজন সৎ ও ভালো ছেলে হিসেবে সম্মানিত।
      </p>
    ),
  },
  {
    title: "দ্বীনি পরিবেশ",
    value: (
      <p>
        আলহামদুলিল্লাহ, আমাদের পরিবারে সবাই নামাজ পড়ে, তবে ছোট ভাই নামাজে একটু
        উদাসীন। <br /> যদিও গ্রামে পরিবেশ কিছুটা মিশ্র থাকে — মাহরাম, নন-মাহরাম
        মেইনটেন করে চলা কঠিন হয়ে যায় এবং সব সময় পুরোপুরি মাহরাম মেইনটেইন করা
        সম্ভব হয় না — তবুও আমরা আলাদা করে যতটুকু সম্ভব দ্বীনের পথে চলার চেষ্টা
        করি। <br /> নিজ পরিবারের মধ্যে দ্বীনের চর্চা ধরে রাখার চেষ্টা করি, যাতে
        অন্তত ঘরের ভিতরে শান্তিপূর্ণ ও ইসলামিক পরিবেশ বজায় থাকে।
      </p>
    ),
  },
];

const FamilyInfo = () => {
  return (
    <SectionContainer title="পারিবারিক তথ্য">
      {familyInfo?.map((info, index) => (
        <h6
          key={index}
          className={`bio-element ${index % 2 !== 0 ? "bg-navy-light/20" : ""}`}
        >
          <span className="bio-label">{info.title}</span>
          <span className="bio-value">{info.value}</span>
        </h6>
      ))}
      {largeContent?.map((info, index) => (
        <MobileViewRow
          key={index}
          label={info.title}
          value={info.value}
          bg={index % 2 !== 0 && "bg-navy-light/20"}
        />
      ))}
    </SectionContainer>
  );
};

export default FamilyInfo;
