import SectionContainer from "./SectionContainer";
const marriageInfo = [
  {
    title: "অভিভাবকের সম্মতি",
    value: "জ্বি রাজি",
  },
  {
    title: "স্ত্রীকে পর্দায় রাখার নিশ্চয়তা",
    value: "অবশ্যই, ইনশাআল্লাহ।",
  },
  {
    title: "স্ত্রীর পড়াশোনার অনুমতি",
    value: "জ্বি চাইলে করতে পারবে।",
  },
  {
    title: "স্ত্রীর চাকরির বিষয়ে মতামত",
    value:
      "যদি এমন কোন জব এবং পরিবেশ হয় যেটা ইসলামিক নিয়মাদর্শে এবং রেগুলার/ইসলামিক লাইফে কোন ইফেক্ট পড়বে না তাহলে করতে পারে এবং চাইলে রিমোট জব করতে পারবে।",
  },
  {
    title: "বিয়ের পর স্ত্রীকে কোথায় নিয়ে থাকবেন",
    value: "আমার সাথে এবং আমি যেখানেই থাকি না কেন।",
  },
  {
    title: "পাত্রীপক্ষের উপহার সম্পর্কে ধারণা",
    value: "নাহ্",
  },
  {
    title: "বিয়ে করার কারণ ও দৃষ্টিভঙ্গি",
    value: `আলহামদুলিল্লাহ, আমি সব সময় ফ্রি মিক্সিং ও হারাম সম্পর্ক থেকে নিজেকে দূরে রাখার চেষ্টা করেছি। আমার ইচ্ছা ছিল আর্লি ম্যারেজ করার, কিন্তু তা বিভিন্ন কারণে সম্ভব হয়নি। তবে এখন আমি স্পষ্টভাবে অনুভব করছি যে, দ্বীনকে পরিপূর্ণ করার জন্য একজন উত্তম জীবনসঙ্গীর প্রয়োজন রয়েছে। একজন সঙ্গী, যার মাধ্যমে আমি দুনিয়া ও আখিরাতে সফলতার দিকে এগিয়ে যেতে পারি — ইনশাআল্লাহ।

বিয়ে আমার কাছে শুধু সামাজিক একটি চুক্তি নয় —
এটি আল্লাহর পক্ষ থেকে ফরজ করা একটি পবিত্র বিধান।
বিয়ে হলো দুজন মানুষের মধ্যে ভালোবাসা, সহযোগিতা ও সাকিনার (প্রশান্তি) সম্পর্ক, যেখানে পরস্পরের প্রতি দায়িত্ব ও শ্রদ্ধাবোধ থাকে।`,
  },
];

const MarriageInfo = () => {
  return (
    <SectionContainer title="পেশাগত তথ্য">
      {marriageInfo?.map((info, index) => (
        <h6
          key={index}
          className={`bio-element ${index % 2 !== 0 ? "bg-navy-light/20" : ""}`}
        >
          <span className="bio-label">{info.title}</span>
          <span className="bio-value">{info.value}</span>
        </h6>
      ))}
    </SectionContainer>
  );
};

export default MarriageInfo;
