import MobileViewRow from "./MobileViewCol";
import SectionContainer from "./SectionContainer";
const marriageInfo = [
  {
    title: "স্ত্রীকে পর্দায় রাখার ব্যাপারে প্রতিশ্রুতি",
    value:
      "ইনশাআল্লাহ, যথাযথভাবে পর্দা রক্ষা করার বিষয়ে আমি পুরোপুরি সচেষ্ট থাকবো।",
  },
  {
    title: "স্ত্রীর পড়াশোনা চালিয়ে যাওয়ার সুযোগ",
    value:
      "জ্বি, যদি সে পড়াশোনা চালিয়ে যেতে চায় এবং তা দীন ও সংসারের ক্ষতি না করে — তাহলে আমি অবশ্যই সহায়তা করবো ইনশাআল্লাহ।",
  },
  {
    title: "স্ত্রীর চাকরির বিষয়ে দৃষ্টিভঙ্গি",
    value:
      "যদি চাকরির ধরন ও পরিবেশ ইসলামি আদর্শের সঙ্গে সামঞ্জস্যপূর্ণ হয় এবং ঘর, পরিবার ও দ্বীনি জীবনে ব্যাঘাত না ঘটে — তাহলে আমি এতে সমর্থন দেবো। রিমোট বা হালাল উপার্জনের সুযোগ থাকলে সেটাও করতে পারবে ইনশাআল্লাহ।",
  },
  {
    title: "বিয়ের পর স্ত্রীর থাকার ব্যবস্থা",
    value:
      "স্ত্রী আমার সঙ্গেই থাকবে — আমি যেখানেই থাকি না কেন, ইনশাআল্লাহ আমরা একসঙ্গেই থাকবো।",
  },
];

const MarriageInfo = () => {
  return (
    <SectionContainer title="বিবাহ সম্পর্কিত তথ্য">
      {marriageInfo?.map((info, index) => (
        <h6
          key={index}
          className={`bio-element ${index % 2 !== 0 ? "bg-navy-light/20" : ""}`}
        >
          <span className="bio-label">{info.title}</span>
          <span className="bio-value">{info.value}</span>
        </h6>
      ))}
      <MobileViewRow
        label={"বিয়ে করার কারণ ও দৃষ্টিভঙ্গি"}
        value={
          <p>
            আলহামদুলিল্লাহ, আমি সব সময় ফ্রি মিক্সিং ও হারাম সম্পর্ক থেকে নিজেকে
            দূরে রাখার চেষ্টা করেছি। আমার ইচ্ছা ছিল আর্লি ম্যারেজ করার, কিন্তু
            তা বিভিন্ন কারণে সম্ভব হয়নি। <br />
            <br /> তবে এখন আমি স্পষ্টভাবে অনুভব করছি যে, দ্বীনকে পরিপূর্ণ করার
            জন্য একজন উত্তম জীবনসঙ্গীর প্রয়োজন রয়েছে। একজন সঙ্গী, যার মাধ্যমে
            আমি দুনিয়া ও আখিরাতে সফলতার দিকে এগিয়ে যেতে পারি — ইনশাআল্লাহ।{" "}
            <br />
            <br /> বিয়ে আমার কাছে শুধু সামাজিক একটি চুক্তি নয় — এটি আল্লাহর পক্ষ
            থেকে ফরজ করা একটি পবিত্র বিধান। বিয়ে হলো দুজন মানুষের মধ্যে
            ভালোবাসা, সহযোগিতা ও সাকিনার (প্রশান্তি) সম্পর্ক, যেখানে পরস্পরের
            প্রতি দায়িত্ব ও শ্রদ্ধাবোধ থাকে।
          </p>
        }
      />
    </SectionContainer>
  );
};

export default MarriageInfo;
