import SectionContainer from "./SectionContainer";
const personalInfo = [
  {
    title: "ঘরের বাহিরে সাধারণত কি ধরণের পোষাক পরেন?",
    value: "জিন্স প্যান্ট, শার্ট, টি শার্ট",
  },
  {
    title: "সুন্নতি দাড়ি আছে কি না? কবে থেকে রেখেছেন?",
    value:
      "না, তবে একবারে ক্লিন শেভ করা হয় না মাঝারি সাইজে রাখা আছে, খুব শীঘ্রই পুরোপুরি রেখে দেবো ইনশাল্লাহ।",
  },
  {
    title: "টাখনুর উপরে কাপড় পরেন?",
    value: "জ্বি, আলহামদুলিল্লাহ্",
  },
  {
    title: "প্রতিদিন পাঁচ ওয়াক্ত নামাজ পড়েন কি? কবে থেকে পড়ছেন?",
    value:
      "জ্বি আলহামদুলিল্লাহ্, আমি ছোট থেকেই নামাজ পড়ি কিন্তু মাঝে মাঝে মিস হয়ে যায়।  সপ্তাহে 3-৬ ওয়াক্ত নামায আপনার কাযা হয়?",
  },

  {
    title: "মাহরাম/নন-মাহরাম মেনে চলেন কি?",
    value: "পুরোপুরি মেনে চলা হয় না তবে যতটুকু পারি ট্রাই করি।",
  },
  {
    title: "শুদ্ধভাবে কুরআন তিলওয়াত করতে পারেন?",
    value: "কিছু জড়তা আছে, রেগুলার তিলাওয়াত করা হয় না।",
  },
  {
    title: "কোন ফিকহ অনুসরণ করেন?",
    value: "হানাফি",
  },
  {
    title: "আপনার মানসিক বা শারীরিক কোনো রোগ আছে?",
    value: "নাহ্, আলহামদুলিল্লাহ্",
  },
  {
    title: "দ্বীনের কোন বিশেষ মেহনতে যুক্ত আছেন?",
    value: "নাহ্",
  },

  {
    title: "পড়া হয়েছে এমন অন্তত ৩ টি ইসলামি বই এর নাম",
    value:
      "অনেক বই পড়লেও ইসলামিক তেমন বই পড়া হয়নি। তবে যে গুলো পড়েছি তার মধ্যে ১.ফেরা, ২.লস্ট ইসলামিক হিস্ট্রি, ৩.প্যারাডক্সিক্যাল সাজিদ, ৪. ইউটার্ন এগুলো ভালো লেগেছে।",
  },
  {
    title: "পছন্দের অন্তত ৩ জন আলেমের নাম",
    value:
      "আল্লামা দেলোয়ার হোসেন সাঈদী, খন্দকার আব্দুল্লাহ জাহাঙ্গীর, শায়খ আহমাদুল্লাহ",
  },
];

const PersonalInfo = () => {
  return (
    <SectionContainer title="পারিবারিক তথ্য">
      {personalInfo?.map((info, index) => (
        <h6
          key={index}
          className={`bio-element ${index % 2 !== 0 ? "bg-navy-light/20" : ""}`}
        >
          <span className="bio-label">{info.title}</span>
          <span className="bio-value">{info.value}</span>
        </h6>
      ))}
      <h6
        className={`flex items-start   divide-x divide-navy-lightest justify-cente`}
      >
        <span className="bio-label pt-4">
          নিজের শখ, পছন্দ-অপছন্দ, রুচিবোধ, স্বপ্ন ইত্যাদি
        </span>
        <span className="bio-value text-justify">
          📚 বই পড়া আমার সবচেয়ে প্রিয় শখগুলোর একটি। বই সংগ্রহ ও পড়ার প্রতি
          দুর্বলতা কাজ করে। যদিও ইদানিং বই পড়ার সময় একটু কম হয়ে গেছে, তবুও
          একটা সুন্দর ছোট্ট লাইব্রেরি গড়ে তোলার ইচ্ছে রয়েছে — ইনশাআল্লাহ।{" "}
          <br /> <br /> 🌿 গাছ লাগানো ও পরিচর্যা আমার আরেকটি শান্তিময় শখ। সুযোগ
          পেলেই গাছ লাগাই — বিশেষ করে ফুলগাছ 🌸। ফ্রি সময়ে এগুলোর যত্ন নেওয়া
          আমার জন্য মানসিক প্রশান্তির উৎস। <br /> <br /> 🧭 ভ্রমণ আমার আরেকটি
          ভালো লাগা। নতুন নতুন জায়গা দেখতে ভালো লাগে, তবে জার্নির কষ্ট আর খরচ
          দুটোই মাথায় আসে — এজন্য সবসময় সম্ভব হয় না। তবুও মনে প্রাণে একজন
          ট্রাভেলার হয়ে উঠার ইচ্ছে আছে। <br /> <br /> 😶‍🌫️ আমি কিছুটা
          ইন্ট্রোভার্ট স্বভাবের। সহজে সবার সঙ্গে মিশে যেতে পারি না, এবং সবার মতো
          হতে চেষ্টা করাও আমার স্বভাবের সঙ্গে যায় না। তবে আমি ভদ্রভাবে কথা বলি,
          বদমেজাজি নই, কাউকে গালিও দেই না। <br /> <br /> 🍃 সাধারণ জীবন আমার
          কাছে সুন্দর। উচ্চাকাঙ্ক্ষা খুব একটা নেই। ভিড় ও কৃত্রিমতা এড়িয়ে চলি।
          আমি চাই সাদামাটা, পরিপাটি, শান্তিপূর্ণ একটা জীবন। <br /> <br /> 🏡
          আমার স্বপ্ন — একটি সুন্দর, সাজানো-গোছানো ইসলামিক পরিবার। যেখানে থাকবে
          পারস্পরিক শ্রদ্ধা, ভালোবাসা ও শান্তি — আর যেখানে ইসলাম নেই, সেখানে
          প্রকৃত শান্তিও নেই। 🌙
        </span>
      </h6>
    </SectionContainer>
  );
};

export default PersonalInfo;
